IDEA StatiCa Open Model
LineSupport.Direction Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 local / global
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public LoadDirection Direction { get; set; }
Public Property Direction As LoadDirection
	Get
	Set
public:
property LoadDirection Direction {
	LoadDirection get ();
	void set (LoadDirection value);
}
Property Value
Type: LoadDirection
See Also
Reference
LineSupport Class
IdeaRS.OpenModel.Detail Namespace